TEST2/meshConvergenceStudy/cases/very_fine/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (metal air);

metal
{
    transportModel  Newtonian;
    // Dynamic viscosity 2.35 mPa·s for molten Ti near 2000 K (Keene, Int. Mater. Rev. 1993)
    nu              nu [ 0 2 -1 0 0 0 0 ] 5.2e-7;
    rho             rho [ 1 -3 0 0 0 0 0 ] 4515;
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.48e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.2;
}

sigma           sigma [1 0 -2 0 0 0 0] 1.64;

icAlpha         icAlpha [0 0 0 0 0 0 0] 0;
scAlpha         scAlpha [0 0 0 0 0 0 0] 0;

phaseChangeMaxSourceDefault phaseChangeMaxSourceDefault [1 -1 -3 0 0 0 0] 4e23;

// ************************************************************************* //
